{
    "name": "Aaron Allen",
    "email": "Aaronallen08441@outlook.com",
    "phone": "+1 (407) 743-3591",
    "address": "86554 Lazy Lake Cir",
    "location": "Yulee, FL",
    "postalCode": "32097",
    "university": "University of North Florida",
    "linkedin": "https://www.linkedin.com/in/aaron-allen-8a90308a",
    "github": "https://github.com/gunmetalAI",
    "summary": "Senior Mobile Software Engineer with 9+ years of experience designing, developing, and deploying high-performance iOS and Android applications. Strong expertise in React Native and native mobile development concepts, with hands-on experience integrating mobile apps with scalable backend services using Node.js, FastAPI, and modern APIs. Proven ability to deliver secure, responsive, and reliable mobile solutions with a focus on performance optimization, offline-first architectures, and robust testing strategies. Experienced in CI/CD automation for mobile pipelines, Agile development, and mentoring engineers to deliver production-grade mobile applications in fast-paced environments.",
    "skills": "iOS | Android | React Native | JavaScript | TypeScript | Swift (working knowledge) | Kotlin (working knowledge) | React.js | Angular | Node.js | Express.js | FastAPI | RESTful APIs | GraphQL | Mobile UI/UX principles | Material Design | Platform-specific guidelines (iOS HIG, Android) | Offline caching | Push notifications | Background sync | PostgreSQL | MongoDB | SQLite | Redis | Jest | React Testing Library | Cypress | Mobile integration testing | Unit Testing | Performance profiling | Application optimization | CI/CD pipelines | GitHub Actions | Azure DevOps | Docker | Mobile build automation | Agile/Scrum | Jira | Git (GitHub, GitLab)",
    "experience": [
        {
            "company": "SS&C Advent",
            "title": "Sr. Software Engineer",
            "location": "",
            "start_date": "Mar 2024",
            "end_date": "Present",
            "bullets": [
                "Led development of cross-platform mobile initiatives using React Native, driving architectural consistency and reusable component patterns.",
                "Designed and optimized mobile-first data flows with a focus on battery usage, network efficiency, and responsive UI behavior.",
                "Owned mobile CI/CD pipelines using GitHub Actions and Azure DevOps, automating build, test, and release workflows across environments.",
                "Partnered with backend and platform teams to define API contracts and improve mobile scalability and reliability.",
                "Conducted mobile architecture and code reviews, ensuring adherence to performance, security, and maintainability standards.",
                "Drove mobile performance optimization efforts, improving load times, stability, and overall user experience.",
                "Mentored junior engineers on mobile best practices, component architecture, and performance-aware development."
            ]
        },
        {
            "company": "SS&C Advent",
            "title": "Software Engineer",
            "location": "",
            "start_date": "Jan 2019",
            "end_date": "Mar 2024",
            "bullets": [
                "Engineered cross-platform mobile applications using React Native, delivering consistent user experiences across iOS and Android devices.",
                "Developed mobile features including offline data storage, background synchronization, and secure authentication flows to support low-connectivity scenarios.",
                "Integrated RESTful and GraphQL APIs into mobile clients, collaborating with backend teams to ensure efficient data transfer and scalability.",
                "Optimized mobile performance through asynchronous processing, state management improvements, and API response tuning.",
                "Implemented unit and integration testing for mobile flows using Jest and React Testing Library, reducing regression issues during releases.",
                "Collaborated with designers and product managers to translate UX requirements into reliable mobile implementations.",
                "Diagnosed and resolved mobile-specific issues related to device performance, network reliability, and platform behavior.",
                "Participated in Agile/Scrum ceremonies, contributing to sprint planning, estimations, and iterative delivery of mobile features."
            ]
        },
        {
            "company": "Deliver Media",
            "title": "Senior Developer",
            "location": "",
            "start_date": "Jul 2017",
            "end_date": "Jan 2019",
            "bullets": [
                "Built and maintained mobile-first applications using React Native, supporting both iOS and Android platforms from a shared codebase.",
                "Implemented mobile UI components aligned with Material Design and platform-specific interaction patterns to enhance usability and accessibility.",
                "Integrated mobile applications with Node.js (Express) backend services, handling authentication, data synchronization, and error handling.",
                "Designed and optimized PostgreSQL-backed APIs to support mobile data consumption with minimal latency.",
                "Added automated testing for mobile-related business logic and UI interactions, improving stability across device types.",
                "Worked closely with product and design teams to translate requirements into mobile-ready features and iterative releases."
            ]
        },
        {
            "company": "Genesys",
            "title": "Associate Software Engineer",
            "location": "",
            "start_date": "May 2016",
            "end_date": "Jun 2017",
            "bullets": [
                "Contributed to mobile-friendly web and hybrid applications, supporting early-stage mobile initiatives using AngularJS, jQuery, and responsive design techniques.",
                "Assisted in developing mobile-integrated backend services using Node.js and PHP, supporting REST-style endpoints consumed by mobile clients.",
                "Worked with MySQL and MongoDB to support data persistence for mobile and web features.",
                "Participated in debugging and performance tuning efforts that improved application stability on mobile devices.",
                "Collaborated within an Agile/Scrum team, gaining hands-on experience with sprint planning, code reviews, and incremental mobile feature delivery."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computing & Information Systems",
            "school": "University of North Florida",
            "start_year": "2013",
            "end_year": "2017"
        }
    ]
}
