{
    "name": "Aaron Allen",
    "email": "Aaronallen08441@outlook.com",
    "phone": "+1 (407) 743-3591",
    "address": "86554 Lazy Lake Cir",
    "location": "Yulee, FL",
    "postalCode": "32097",
    "university": "University of North Florida",
    "linkedin": "https://www.linkedin.com/in/aaron-allen-8a90308a",
    "github": "https://github.com/gunmetalAI",
    "summary": "Full Stack Software Engineer with 9+ years of experience designing, developing, and deploying scalable web and mobile applications. Skilled in React, Angular, React Native, Node.js, and databases such as PostgreSQL and MongoDB, with a strong background in AI/ML integration using Python, FastAPI, and TensorFlow/PyTorch. Experienced in building high-performance, secure, and testable systems, implementing unit, integration, and end-to-end testing, and optimizing application performance through caching, query tuning, and asynchronous processing. Adept at CI/CD automation with GitHub Actions and Azure DevOps, Agile methodologies, and mentoring junior engineers, delivering enterprise-grade solutions in fast-paced environments.",
    "skills": "Ruby | Ruby on Rails | React.js | Angular | Next.js | TypeScript | JavaScript | React Native | Material UI | React Hook Form | Node.js | Express.js | FastAPI | Python | RESTful APIs | GraphQL | PostgreSQL | MongoDB | SQL Server | Redis | Sidekiq | Background Jobs | ActiveRecord Optimization | TensorFlow | PyTorch | NumPy | Pandas | AI-powered search | Predictive analytics | RSpec | Jest | React Testing Library | Cypress | xUnit | Integration Testing | End-to-End Testing | Unit Testing | Caching strategies | Asynchronous processing | Query optimization | Application profiling | Azure DevOps | GitHub Actions | Docker | CI/CD pipelines | Cloud deployment automation | Agile/Scrum | Jira | Confluence | Git (GitHub, GitLab, Bitbucket) | Team mentoring | Cross-functional collaboration",
    "experience": [
        {
            "company": "SS&C Advent",
            "title": "Sr. Software Engineer",
            "location": "",
            "start_date": "Mar 2024",
            "end_date": "Present",
            "bullets": [
                "Architected scalable Node.js backend services supporting enterprise SaaS workflows and high-throughput user activity.",
                "Led design of RESTful API contracts and service boundaries, improving reliability and long-term maintainability.",
                "Owned CI/CD pipelines using GitHub Actions and Azure DevOps, automating testing, builds, and cloud deployments.",
                "Drove performance optimization initiatives including advanced caching strategies and asynchronous processing across services.",
                "Played a key role in architecture reviews and technical decision-making for Node.js and full-stack services.",
                "Partnered with frontend, platform, and data teams to align Node.js services with product and scalability requirements.",
                "Mentored junior engineers, promoting best practices in Node.js development, testing discipline, and Agile delivery."
            ]
        },
        {
            "company": "SS&C Advent",
            "title": "Software Engineer",
            "location": "",
            "start_date": "Jan 2019",
            "end_date": "Mar 2024",
            "bullets": [
                "Engineered enterprise web and mobile applications using React, Angular, and React Native, delivering responsive and high-performance cross-platform solutions.",
                "Designed and maintained Node.js backend services, implementing RESTful APIs for core platform features and internal workflows.",
                "Built and optimized PostgreSQL and MongoDB data layers, improving query performance, data integrity, and support for high-volume transactions.",
                "Integrated AI-enabled backend services using Python and FastAPI to support intelligent search, recommendations, and data-driven features.",
                "Implemented unit and integration testing using Jest, React Testing Library, Cypress, and xUnit, reducing regressions and improving release stability.",
                "Improved application performance through caching strategies, asynchronous processing, and optimized data access patterns.",
                "Collaborated with product managers and QA teams to translate requirements into scalable Node.js solutions within Agile/Scrum teams.",
                "Participated in code reviews and debugging sessions, contributing to shared standards for clean architecture and maintainable code."
            ]
        },
        {
            "company": "Deliver Media",
            "title": "Senior Developer",
            "location": "",
            "start_date": "Jul 2017",
            "end_date": "Jan 2019",
            "bullets": [
                "Developed and maintained full-stack web applications using Ruby on Rails and React.js, delivering internal tools and customer-facing dashboards.",
                "Built Rails controllers, models, and services, implementing authentication flows, business logic, and RESTful APIs.",
                "Designed and optimized PostgreSQL schemas, wrote efficient queries, and managed schema migrations to support evolving product requirements.",
                "Implemented background jobs and scheduled tasks to handle asynchronous processing and data synchronization.",
                "Wrote unit and integration tests using RSpec, Jest, Mocha, and Chai, improving test coverage and deployment confidence.",
                "Collaborated with designers and stakeholders to translate product requirements into scalable Rails features and intuitive UI components.",
                "Used Docker, Git-based workflows, and CI pipelines to support consistent development environments and reliable deployments."
            ]
        },
        {
            "company": "Genesys",
            "title": "Associate Software Engineer",
            "location": "",
            "start_date": "May 2016",
            "end_date": "Jun 2017",
            "bullets": [
                "Contributed to web application development using AngularJS, jQuery, and early Ruby on Rails components, implementing UI logic and backend features under senior guidance.",
                "Assisted in building server-side functionality using Ruby, Node.js, and PHP, supporting REST-style endpoints and workflow-driven features.",
                "Worked with MySQL and MongoDB to perform data modeling, write queries, and support CRUD operations.",
                "Participated in debugging, maintenance, and performance tuning, resolving issues reported by QA and improving application reliability.",
                "Used Git for version control and actively participated in Agile/Scrum ceremonies, sprint planning, and code reviews to align with team standards."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computing & Information Systems",
            "school": "University of North Florida",
            "start_year": "2013",
            "end_year": "2017"
        }
    ]
}
