{
    "name": "Aaron Allen",
    "email": "Aaronallen08441@outlook.com",
    "phone": "+1 (407) 743-3591",
    "address": "86554 Lazy Lake Cir",
    "location": "Yulee, FL",
    "postalCode": "32097",
    "university": "University of North Florida",
    "linkedin": "https://www.linkedin.com/in/aaron-allen-8a90308a",
    "github": "https://github.com/gunmetalAI",
    "summary": "Full Stack .NET Developer with 9+ years of experience designing, developing, and deploying scalable web and enterprise applications. Skilled in C#, .NET Core, ASP.NET Core, Entity Framework, React, Angular, and React Native. Experienced in AI/ML integration using Python, FastAPI, and TensorFlow/PyTorch. Adept at building secure, high-performance, and testable systems, implementing unit, integration, and end-to-end testing, and optimizing application performance through caching, query tuning, and asynchronous processing. Proficient in CI/CD automation with Azure DevOps and GitHub Actions, Agile methodologies, and mentoring junior engineers, delivering enterprise-grade solutions in fast-paced environments.",
    "skills": "C# | .NET Core | ASP.NET Core | Web API | Entity Framework Core | LINQ | React.js | React Native | Angular | Next.js | TypeScript | JavaScript | Material UI | React Hook Form | jQuery | Node.js | Express.js | FastAPI | Python | RESTful APIs | GraphQL | SQL Server | PostgreSQL | MongoDB | Redis | TensorFlow | PyTorch | NumPy | Pandas | Scikit-learn | AI-powered search | Predictive analytics | xUnit | NUnit | MSTest | Jest | React Testing Library | Cypress | Integration Testing | End-to-End Testing | Unit Testing | Caching strategies | Asynchronous processing | Query optimization | Application profiling | Azure DevOps | GitHub Actions | Docker | CI/CD pipelines | Cloud deployment automation | Agile/Scrum | Jira | Confluence | Git (GitHub, GitLab, Bitbucket) | Team mentoring | Cross-functional collaboration",
    "experience": [
        {
            "company": "SS&C Advent",
            "title": "Sr. Software Engineer",
            "location": "",
            "start_date": "Mar 2024",
            "end_date": "Present",
            "bullets": [
                "Architected and delivered scalable backend services using C#/.NET Core, ASP.NET Core, and microservices patterns, supporting high-volume enterprise workloads.",
                "Led frontend initiatives using React and React Native, improving feature delivery speed through component standardization and improved API contracts.",
                "Integrated AI/ML services using Python, FastAPI, and TensorFlow/PyTorch, enabling predictive analytics and recommendation capabilities across customer-facing and internal systems.",
                "Improved system scalability and reliability by implementing Redis caching, advanced asynchronous processing, and optimized data access strategies.",
                "Designed and owned CI/CD pipelines using Azure DevOps and GitHub Actions, automating builds, testing, and deployments and reducing release cycles from days to hours.",
                "Played a key role in architecture reviews and technical decision-making, ensuring security, scalability, and maintainability across enterprise platforms.",
                "Mentored junior engineers through code reviews, pair programming, and technical guidance, promoting best practices in testing, design patterns, and Agile delivery."
            ]
        },
        {
            "company": "SS&C Advent",
            "title": "Software Engineer",
            "location": "",
            "start_date": "Jan 2019",
            "end_date": "Mar 2024",
            "bullets": [
                "Engineered enterprise-grade backend systems using C#/.NET Core and ASP.NET Core, building RESTful APIs and background processing pipelines supporting business-critical workflows.",
                "Developed modern frontend applications using React and Angular, delivering reusable components and clean API integrations to improve usability and development efficiency.",
                "Designed and optimized SQL Server and PostgreSQL data models with Entity Framework Core, improving query performance through indexing, tuning, and controlled schema migrations.",
                "Integrated Python-based services into .NET platforms using FastAPI, enabling intelligent search, recommendation features, and data-driven workflows.",
                "Implemented unit and integration testing with xUnit, NUnit, and Jest, improving test coverage and reducing regression issues during frequent releases.",
                "Improved application performance by implementing asynchronous processing and optimized data access patterns, reducing API response times under load.",
                "Collaborated with product managers and QA teams to translate requirements into scalable technical solutions within Agile/Scrum environments.",
                "Participated in code reviews and debugging sessions, contributing to shared standards for maintainability, testing, and clean architecture."
            ]
        },
        {
            "company": "Deliver Media",
            "title": "Senior Developer",
            "location": "",
            "start_date": "Jul 2017",
            "end_date": "Jan 2019",
            "bullets": [
                "Developed full-stack applications using .NET Core, React.js, and Node.js, delivering internal tools and customer-facing dashboards used by operations and business stakeholders.",
                "Designed and implemented RESTful APIs, handling authentication, validation, and business logic, improving system reliability and simplifying frontend-backend integration.",
                "Built and optimized SQL Server and MongoDB data models to support transactional workflows and analytics use cases, improving data consistency and query performance.",
                "Implemented backend and frontend testing using xUnit, Jest, Mocha, and Chai, reducing production issues and improving confidence in frequent releases.",
                "Collaborated closely with designers, product owners, and stakeholders to translate requirements into scalable technical solutions, consistently delivering features on schedule.",
                "Used Docker, Git, and CI workflows to standardize development environments and improve deployment reliability across environments."
            ]
        },
        {
            "company": "Genesys",
            "title": "Associate Software Engineer",
            "location": "",
            "start_date": "May 2016",
            "end_date": "Jun 2017",
            "bullets": [
                "Contributed to internal and customer-facing web applications using AngularJS, jQuery, and ASP.NET Web API, implementing dynamic UI features and server-side workflows.",
                "Assisted in building backend services using C# .NET and Node.js, supporting REST-style endpoints for user management and internal operational tools.",
                "Worked with SQL Server and MongoDB to design schemas, write queries, and support CRUD operations for production systems.",
                "Diagnosed and resolved frontend and backend issues reported by QA and users, improving application stability and reducing recurring defects.",
                "Participated in Agile/Scrum ceremonies, including sprint planning, estimation, and retrospectives, gaining experience in collaborative, iterative development."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computing & Information Systems",
            "school": "University of North Florida",
            "start_year": "2013",
            "end_year": "2017"
        }
    ]
}
