{
    "name": "Aaron Allen",
    "email": "Aaronallen08441@outlook.com",
    "phone": "",
    "address": "86554 Lazy Lake Cir",
    "location": "Yulee, FL",
    "postalCode": "32097",
    "university": "University of North Florida",
    "linkedin": "https://www.linkedin.com/in/aaron-allen-8a90308a",
    "github": "https://github.com/gunmetalAI",
    "summary": "Full Stack Software Engineer with 9+ years of experience designing, developing, and deploying scalable web and mobile applications. Skilled in React, Angular, React Native, Node.js, and databases such as PostgreSQL and MongoDB, with a strong background in AI/ML integration using Python, FastAPI, and TensorFlow/PyTorch. Experienced in building high-performance, secure, and testable systems, implementing unit, integration, and end-to-end testing, and optimizing application performance through caching, query tuning, and asynchronous processing. Adept at CI/CD automation with GitHub Actions and Azure DevOps, Agile methodologies, and mentoring junior engineers, delivering enterprise-grade solutions in fast-paced environments.",
    "skills": "Ruby | Ruby on Rails | React.js | Angular | Next.js | TypeScript | JavaScript | React Native | Material UI | React Hook Form | Node.js | Express.js | FastAPI | Python | RESTful APIs | GraphQL | PostgreSQL | MongoDB | SQL Server | Redis | Sidekiq | Background Jobs | ActiveRecord Optimization | TensorFlow | PyTorch | NumPy | Pandas | AI-powered search | Predictive analytics | RSpec | Jest | React Testing Library | Cypress | xUnit | Integration Testing | End-to-End Testing | Unit Testing | Caching strategies | Asynchronous processing | Query optimization | Application profiling | Azure DevOps | GitHub Actions | Docker | CI/CD pipelines | Cloud deployment automation | Agile/Scrum | Jira | Confluence | Git (GitHub, GitLab, Bitbucket) | Team mentoring | Cross-functional collaboration",
    "experience": [
        {
            "company": "SS&C Advent",
            "title": "Sr. Software Engineer",
            "location": "",
            "start_date": "Jan 2019",
            "end_date": "Present",
            "bullets": [
                "Engineered enterprise-grade web platforms using Ruby on Rails for core backend services and React / Angular for modern, responsive frontend experiences.",
                "Designed and maintained Rails-based APIs, implementing RESTful endpoints, service objects, and background workflows using Sidekiq and Redis to support high-volume business operations.",
                "Led data modeling and persistence strategies across PostgreSQL and MongoDB, optimizing ActiveRecord queries, indexes, and transactional boundaries.",
                "Built and deployed AI-powered features using Python, FastAPI, and TensorFlow/PyTorch, integrating predictive analytics and intelligent search into Rails-backed systems.",
                "Implemented comprehensive automated testing using RSpec, Jest, React Testing Library, Cypress, and xUnit, significantly reducing regression issues and improving release stability.",
                "Optimized application performance through caching strategies, asynchronous processing, and database query tuning, improving response times and overall system throughput.",
                "Developed and maintained CI/CD pipelines with GitHub Actions and Azure DevOps, enabling automated testing, zero-downtime deployments, and environment-based releases.",
                "Collaborated closely with architects, product managers, and QA teams on system design, code reviews, and architectural decisions to ensure scalable and maintainable solutions.",
                "Mentored junior engineers on Rails best practices, testing strategies, and clean architecture principles within an Agile/Scrum environment."
            ]
        },
        {
            "company": "Deliver Media",
            "title": "Senior Developer",
            "location": "",
            "start_date": "Jul 2017",
            "end_date": "Jan 2019",
            "bullets": [
                "Developed and maintained full-stack web applications using Ruby on Rails and React.js, delivering internal tools and customer-facing dashboards.",
                "Built Rails controllers, models, and services, implementing authentication flows, business logic, and RESTful APIs.",
                "Designed and optimized PostgreSQL schemas, wrote efficient queries, and managed schema migrations to support evolving product requirements.",
                "Implemented background jobs and scheduled tasks to handle asynchronous processing and data synchronization.",
                "Wrote unit and integration tests using RSpec, Jest, Mocha, and Chai, improving test coverage and deployment confidence.",
                "Collaborated with designers and stakeholders to translate product requirements into scalable Rails features and intuitive UI components.",
                "Used Docker, Git-based workflows, and CI pipelines to support consistent development environments and reliable deployments."
            ]
        },
        {
            "company": "Genesys",
            "title": "Associate Software Engineer",
            "location": "",
            "start_date": "May 2016",
            "end_date": "Jun 2017",
            "bullets": [
                "Contributed to web application development using AngularJS, jQuery, and early Ruby on Rails components, implementing UI logic and backend features under senior guidance.",
                "Assisted in building server-side functionality using Ruby, Node.js, and PHP, supporting REST-style endpoints and workflow-driven features.",
                "Worked with MySQL and MongoDB to perform data modeling, write queries, and support CRUD operations.",
                "Participated in debugging, maintenance, and performance tuning, resolving issues reported by QA and improving application reliability.",
                "Used Git for version control and actively participated in Agile/Scrum ceremonies, sprint planning, and code reviews to align with team standards."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computing & Information Systems",
            "school": "University of North Florida",
            "start_year": "2013",
            "end_year": "2017"
        }
    ]
}
