{
  "name": "John Taylor",
  "email": "johntaylor8871@outlook.com",
  "phone": "+1 (737) 244-0919",
  "address": "3009 Stock Dr",
  "location": "Austin, TX",
  "postalCode": "78741",
  "university": "University of Antelope Valley",
  "linkedin": "https://www.linkedin.com/in/johntaylorcs",
  "github": "https://github.com/johnataylor",
  "summary": "Senior QA Engineer with 10+ years of experience ensuring quality, reliability, and performance of complex web and mobile applications. Strong background in test automation, API testing, and end-to-end validation across frontend, backend, and cloud-based systems. Experienced in designing scalable test frameworks, validating integrations with third-party services, and collaborating closely with engineering teams in Agile environments. Proficient in JavaScript, TypeScript, Python, and C#, with hands-on experience testing applications built with React, Node.js, and .NET on AWS and Azure. ",
  "skills": {
      "Testing & QA": ["Test Automation", "Manual Testing", "API Testing", "End-to-End Testing", "Integration Testing", "Regression Testing", "Test Case Design", "Test Strategy", "Defect Tracking"],
      "Automation Tools": ["Jest", "React Testing Library", "Cypress", "xUnit", "Postman", "Supertest"],
      "Programming & Scripting": ["JavaScript", "TypeScript", "Python", "C#"],
      "Application Under Test (AUT) Technologies": ["React", "React Native", "Next.js", "Angular", "Node.js", "ASP.NET Core", ".NET"],
      "APIs & Integrations": ["RESTful APIs", "GraphQL", "Stripe", "Twilio", "Identity Server"],
      "Databases": ["PostgreSQL", "MySQL", "MongoDB", "SQL Server", "Azure Cosmos DB", "Redis"],
      "Cloud & CI/CD": ["Microsoft Azure", "AWS", "GitHub Actions", "GitLab CI", "Azure DevOps", "Docker"],
      "Security & Performance": ["BAC", "JWT", "OWASP Top 10 Awareness", "Authentication Testing", "Performance Validation"],
      "Collaboration": ["Agile/Scrum", "Jira", "Confluence", "Git", "Slack", "Cross-functional Team Collaboration"]

  },
  "experience": [
      {
          "company": "Accenture",
          "title": "Senior QA Engineer",
          "location": "",
          "start_date": "Nov 2023",
          "end_date": "Present",
          "bullets": [
              "Designed and executed comprehensive test strategies for web and mobile applications built with React, React Native, Node.js, and .NET.",
              "Developed and maintained automated test suites for frontend, backend, and API layers using Jest, React Testing Library, Cypress, and xUnit.",
              "Performed API testing and validation for RESTful services supporting user onboarding, authentication, and data management workflows.",
              "Validated authentication and authorization flows, including role-based access control and identity management solutions.",
              "Tested and verified third-party integrations such as payment processing and real-time notification services to ensure reliability and data integrity.",
              "Conducted regression, smoke, and end-to-end testing as part of CI/CD pipelines to reduce production defects.",
              "Monitored application health and test results using Azure Application Insights and collaborated with DevOps teams to support release quality.",
              "Partnered closely with developers and product stakeholders to identify risks early and improve overall software quality."
          ]
      },
      {
          "company": "Webhead",
          "title": "Software Tester/QA Engineer",
          "location": "",
          "start_date": "Jul 2015",
          "end_date": "Sep 2023",
          "bullets": [
              "Executed manual and automated testing for backend services built with .NET and ASP.NET Core, ensuring correctness of business logic and data processing.",
              "Designed and maintained test cases and test data for applications using MongoDB and SQL-based databases.",
              "Automated frontend test scenarios for React and Angular applications to validate user workflows and UI behavior.",
              "Performed integration testing across distributed system components and external services.",
              "Validated backend processes and data pipelines supported by Python-based automation scripts.",
              "Increased test coverage through unit, integration, and API testing, reducing post-release defects.",
              "Collaborated with cross-functional teams in Agile environments to support sprint planning, defect triage, and release readiness."
          ]
      }
  ],
  "education": [
      {
          "degree": "Bachelor’s degree in Computer Science",
          "school": "University of Antelope Valley",
          "start_year": "2011",
          "end_year": "2014"
      }
  ]
}
