{
    "name": "Nathan Kamenar",
    "email": "nathankamenar158@gmail.com",
    "phone": "+1 (218) 332-0680",
    "address": "425 Arch Ave",
    "location": "Greensburg, PA",
    "postalCode": "15601",
    "university": "Edinboro University of Pennsylvania",
    "linkedin": "https://www.linkedin.com/in/nathan-kamenar-72ba84a8",
    "github": "https://github.com/DebugMaster25",
    "summary": "Senior Full Stack Software Engineer with 9+ years of experience designing and delivering scalable, production-grade web platforms using ASP.NET Core (C#) and Node.js. Strong expertise in building cloud-native applications on Microsoft Azure, combining microservice and event-driven architectures with modern frontend frameworks. Proven experience integrating Python-based AI/ML services (FastAPI) into enterprise systems, implementing robust CI/CD automation, and optimizing distributed systems for performance and reliability. Adept at leading Agile teams, making architectural decisions, and bridging intelligent backend services with intuitive user experiences using React and Next.js.",
    "skills": {
        "Backend": ["ASP.NET Core", ".NET 6+", "C#", "Web API", "Node.js", "NestJS", "Express.js", "Python (FastAPI)"],
        "Frontend": ["React.js", "Next.js", "Angular", "Vue.js", "TypeScript"],
        "AI / Machine Learning": ["FastAPI-based ML services", "TensorFlow", "scikit-learn", "PyTorch", "Pandas", "NumPy", "spaCy"],
        "Cloud & DevOps": ["Microsoft Azure (App Service, AKS, Azure Functions, Azure SQL, Service Bus, Storage, Application Insights)", "Docker", "Kubernetes", "Terraform", "Azure DevOps", "GitHub Actions"],
        "Databases": ["Azure SQL", "SQL Server", "PostgreSQL", "MongoDB", "Redis", "Cosmos DB"],
        "Automation & Testing": ["xUnit", "NUnit", "Jest", "PyTest", "Mocha", "Postman", "Newman"],
        "Tools & Methodologies": ["Git", "Agile/Scrum", "CI/CD", "REST", "GraphQL", "WebSockets", "Microservices", "Event-Driven Architecture"],
        "Monitoring & Observability": ["Azure Monitor", "Application Insights", "Prometheus", "Grafana", "ELK Stack"]
    },
    "experience": [
        {
            "company": "KeyLogic",
            "title": "Senior Software Engineer",
            "location": "",
            "start_date": "Aug 2016",
            "end_date": "Present",
            "bullets": [
                "Architected and led enterprise-grade web platforms using ASP.NET Core (C#) and Node.js (NestJS, Express), designing clean, scalable RESTful APIs and modular service layers for high-throughput systems.",
                "Designed and implemented microservice and event-driven architectures across .NET and Node.js services using Azure Service Bus and asynchronous processing patterns to improve scalability and fault tolerance.",
                "Built AI-enabled backend services by integrating Python (FastAPI) machine learning pipelines with .NET and Node.js APIs, enabling anomaly detection, forecasting, and advanced analytics workflows.",
                "Developed and optimized data access layers using Entity Framework Core, Dapper, and SQL optimization techniques, improving query performance, data consistency, and transactional reliability.",
                "Led cloud-native deployments on Microsoft Azure, hosting APIs on Azure App Service and AKS, using Docker and Infrastructure as Code (ARM/Bicep, Terraform) to ensure environment consistency and repeatable releases.",
                "Implemented serverless and background processing using Azure Functions for event handling, scheduled jobs, and asynchronous workloads.",
                "Established robust CI/CD pipelines using Azure DevOps and GitHub Actions, automating builds, testing, security checks, and zero-downtime deployments for .NET and Node.js applications.",
                "Developed modern, responsive frontend applications using React, Next.js, and TypeScript, integrating real-time data via WebSockets, REST, and GraphQL APIs.",
                "Implemented system-wide monitoring and observability using Azure Monitor, Application Insights, Prometheus, and Grafana, enabling proactive alerting and high availability.",
                "Collaborated with cross-functional teams and mentored engineers, contributing to architectural decisions, code reviews, and Agile ceremonies to maintain high engineering standards."
            ]
        },
        {
            "company": "KeyLogic Systems",
            "title": "SharePoint Engineer",
            "location": "",
            "start_date": "Jan 2016",
            "end_date": "Jul 2016",
            "bullets": [
                "Designed and customized SharePoint 2013 and SharePoint Online sites for document management, team collaboration, and workflow automation.",
                "Built custom workflows using SharePoint Designer and Power Automate, reducing manual approval and reporting effort.",
                "Extended SharePoint functionality using JavaScript, REST APIs, and SPFx-style custom components.",
                "Managed permissions, content types, and site structures to support secure and scalable enterprise usage."
            ]
        },
        {
            "company": "ShahPoint",
            "title": "SharePoint Engineer",
            "location": "",
            "start_date": "Mar 2013",
            "end_date": "Dec 2015",
            "bullets": [
                "Developed and maintained SharePoint 2010/2013 sites for internal collaboration, knowledge management, and reporting.",
                "Customized SharePoint UI using master pages, JavaScript, jQuery, and CSS to align with business branding and usability requirements.",
                "Implemented automated workflows for document approvals and notifications using SharePoint Designer.",
                "Supported SharePoint integrations and data migrations while assisting with performance tuning and issue resolution."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computer Science",
            "school": "Edinboro University of Pennsylvania",
            "start_year": "2007",
            "end_year": "2013"
        }
    ]
}
