{
    "name": "Nathan Kamenar",
    "email": "nathankamenar158@gmail.com",
    "phone": "+1 (218) 332-0680",
    "location": "Greensburg, PA",
    "postalCode": "15601",
    "linkedin": "https://www.linkedin.com/in/nathan-kamenar-72ba84a",
    "github": "https://github.com/DebugMaster25",
    "summary": "Senior Mobile Engineer with 9+ years of experience designing, building, and delivering high-performance iOS and Android applications across React Native, Flutter, Swift, and Kotlin. Expert in end-to-end mobile app lifecycle, including architecture, CI/CD, testing, deployment, and post-launch optimization. Skilled in offline-first architectures, AI/ML integration, and performance tuning to ensure responsive, reliable, and user-friendly apps. Experienced in mentoring engineers, collaborating with UX/UI teams, and implementing domain-specific features for fintech, health, and consumer applications. Strong focus on cross-platform development, native integration, automated testing, and app store compliance.",
    "skills": {
        "Mobile Development": ["React Native", "Flutter", "Swift", "Kotlin", "Objective-C", "cross-platform development", "native module integration"],
        "Backend & APIs": ["REST", "GraphQL", "real-time data synchronization", "push notifications", "offline-first workflows"],
        "Testing & QA": ["Unit testing", "Integration testing", "End-to-end testing", "Jest", "Detox", "Flutter Tests", "Espresso", "XCTest"],
        "Performance & Optimization": ["Memory profiling", "UI performance tuning", "caching strategies", "offline-first architectures", "battery-efficient design"],
        "CI/CD & Deployment": ["GitHub Actions", "Fastlane", "automated build/test/deploy pipelines", "App Store & Google Play deployment", "subscription management", "release compliance"],
        "Observability & Analytics": ["Sentry", "Firebase Analytics", "crash reporting", "performance monitoring", "data-driven improvements"],
        "AI/ML Integration": ["Python-based ML services", "anomaly detection", "recommendations", "predictive insights"],
        "Collaboration & Leadership": ["Mentoring", "cross-functional collaboration", "UX/UI translation", "code review", "best practices"]
    },
    "experience": [
        {
            "company": "KeyLogic",
            "title": "Senior Software Engineer",
            "location": "",
            "start_date": "Aug 2016",
            "end_date": "Present",
            "bullets": [
                "Architected and led development of production-grade cross-platform mobile applications using React Native, Flutter, Swift, and Kotlin, delivering responsive, feature-rich iOS and Android apps with a strong focus on performance, reliability, and user experience.",
                "Owned the end-to-end mobile app lifecycle, from architecture and feature implementation to app store release, post-launch optimization, and compliance with App Store/Play Store guidelines, including subscription management and review processes.",
                "Designed mobile-facing APIs and services to support real-time data synchronization, push notifications, offline-first workflows, and domain-specific requirements (e.g., fintech payments, HIPAA-compliant data handling), ensuring seamless app behavior under variable network conditions.",
                "Integrated AI/ML-powered features via Python-based backend services for anomaly detection, personalized recommendations, and predictive insights, maintaining low latency, battery efficiency, and responsive UI interactions.",
                "Implemented offline-first architectures, local persistence, and intelligent caching strategies, improving perceived app responsiveness and reliability in low-network environments.",
                "Applied advanced performance profiling, memory optimization, and UI/UX enhancements to reduce app startup time, prevent memory leaks, and ensure smooth experiences on low- and high-end devices.",
                "Developed and maintained mobile CI/CD pipelines using GitHub Actions and Fastlane, incorporating unit, integration, and end-to-end tests with Jest, Detox, Flutter tests, Espresso, and XCTest to ensure release quality and stability.",
                "Introduced mobile observability and crash monitoring using Sentry and Firebase Analytics to track performance regressions, crashes, and user engagement, enabling data-driven app improvements.",
                "Collaborated with UX/UI designers and product teams to translate design systems into intuitive, accessible interfaces, ensuring consistent behavior across platforms and device types.",
                "Mentored mobile engineers on cross-platform development patterns, native integration, testing best practices, and performance optimization, elevating overall code quality and maintainability."
            ]
        },
        {
            "company": "KeyLogic Systems",
            "title": "SharePoint Engineer",
            "location": "",
            "start_date": "Jan 2016",
            "end_date": "Jul 2016",
            "bullets": [
                "Designed and customized SharePoint 2013 and SharePoint Online sites for document management, team collaboration, and workflow automation.",
                "Built custom workflows using SharePoint Designer and Power Automate, reducing manual approval and reporting effort.",
                "Extended SharePoint functionality using JavaScript, REST APIs, and SPFx-style custom components.",
                "Managed permissions, content types, and site structures to support secure and scalable enterprise usage."
            ]
        },
        {
            "company": "ShahPoint",
            "title": "SharePoint Engineer",
            "location": "",
            "start_date": "Mar 2013",
            "end_date": "Dec 2015",
            "bullets": [
                "Developed and maintained SharePoint 2010/2013 sites for internal collaboration, knowledge management, and reporting.",
                "Customized SharePoint UI using master pages, JavaScript, jQuery, and CSS to align with business branding and usability requirements.",
                "Implemented automated workflows for document approvals and notifications using SharePoint Designer.",
                "Supported SharePoint integrations and data migrations while assisting with performance tuning and issue resolution."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computer Science",
            "school": "Edinboro University of Pennsylvania",
            "start_year": "2007",
            "end_year": "2013"
        }
    ]
}
