{
    "name": "Andrew James",
    "email": "andrewjamesdev@outlook.com",
    "phone": "+1 (218) 332-0680",
    "address": "415 Avenue I",
    "location": "Dallas, TX",
    "postalCode": "75203",
    "university": "Argosy University",
    "linkedin": "https://www.linkedin.com/in/andrewjamesdev/",
    "github": "https://github.com/andrewjames",
    "summary": "Senior QA Automation Lead / SDET with 8+ years of experience designing and scaling automated testing frameworks for high-traffic media, financial, and data-driven platforms. Proven expertise in end-to-end test automation across web, mobile, and API layers using Selenium, Cypress, and Playwright, with deep integration into CI/CD pipelines. Strong background in API, microservices, performance, and security testing, including compliance-driven environments (PCI DSS, HIPAA, GDPR). Known for driving shift-left testing, improving release confidence, and mentoring QA teams in fast-paced, high-stakes production environments.",
    "skills": {
        "Test Automation & QA": ["Selenium", "Cypress", "Playwright", "Jest", "React Testing Library", "xUnit", "Postman", "Supertest", "End-to-End Testing", "Integration Testing", "API Testing", "Unit Testing", "Cross-Browser Testing (BrowserStack)"],
        "Performance & Reliability": ["k6", "Grafana", "Load Testing", "Stress Testing", "Performance Monitoring", "Test Metrics & Reporting"],
        "CI/CD & DevOps": ["Jenkins", "GitLab CI", "GitHub Actions", "Docker", "Kubernetes", "CI/CD Pipeline Integration", "Test Automation in DevOps Workflows"],
        "Programming & Scripting": ["JavaScript", "TypeScript", "Python", "C#"],
        "Frontend Technologies": ["React.js", "Angular", "Next.js", "HTML5", "CSS3"],
        "Backend & APIs": ["Node.js", "Express.js", "ASP.NET Core", "RESTful APIs", "GraphQL", "Microservices Architecture"],
        "Databases": ["PostgreSQL", "MySQL", "MongoDB", "SQL Server", "Redis"],
        "Cloud Platforms": ["AWS", "Microsoft Azure", "Azure DevOps", "Application Insights"],
        "Security & Compliance": ["OWASP Top 10", "Secure Authentication", "JWT", "Role-Based Access Control (RBAC)", "PCI DSS", "HIPAA", "GDPR", "SOC Compliance Testing"],
        "Process & Collaboration": ["Agile/Scrum", "Shift-Left Testing", "TDD Support", "Jira", "Confluence", "Git", "Cross-Functional Team Collaboration", "QA Mentorship & Leadership"]
    },
    "experience": [
        {
            "company": "Soft Tech Consulting",
            "title": "Senior QA Automation Lead / SDET",
            "location": "",
            "start_date": "Jan 2024",
            "end_date": "Present",
            "bullets": [
                "Led end-to-end QA automation strategy for large-scale digital platforms handling high-traffic media and financial data, covering web, mobile, and API layers.",
                "Designed and maintained scalable automation frameworks using Selenium, Cypress, Playwright, and Python, increasing overall automated test coverage to over 80%.",
                "Implemented robust API and microservices testing for REST and GraphQL services, significantly improving data integrity and system reliability.",
                "Integrated automated testing into CI/CD pipelines using Jenkins, GitLab CI, Docker, and Kubernetes, reducing manual testing effort by more than 60%.",
                "Built and executed performance and load testing suites using k6 and Grafana, improving application response times and stability during peak usage.",
                "Established security and compliance-focused testing practices aligned with PCI DSS, HIPAA, GDPR, and SOC standards for data-sensitive systems.",
                "Collaborated closely with frontend and backend teams using React, Angular, Node.js, Java, and Python to support shift-left testing and TDD practices.",
                "Implemented cross-browser and cross-device testing strategies using BrowserStack, ensuring consistent behavior across 25+ environments.",
                "Created QA dashboards and reporting metrics to track test coverage, defect trends, and release readiness, enabling data-driven quality decisions.",
                "Mentored and led QA engineers, setting best practices for automation, test design, and continuous improvement across distributed teams."
            ]
        },
        {
            "company": "Ingenious",
            "title": "Senior QA Engineer",
            "location": "",
            "start_date": "Jul 2020",
            "end_date": "Dec 2023",
            "bullets": [
                "Architected automation frameworks with Cypress, executing tests on CNN platforms, delivering consistent data integrity during high-profile election broadcasts.",
                "Streamlined backend validation for real-time data synchronization, improving API reliability by 50% during live events.",
                "Integrated test automation into Jenkins pipelines, reducing manual testing by 65% and expediting deployment cycles.",
                "Conducted cross-browser testing with BrowserStack, ensuring device compatibility across more than 25+ configurations.",
                "Collaborated on TDD practices with Gherkin, initiating test involvement from project outset to optimize development cycles.",
                "Executed stress tests on news platforms to ensure durable, downtime-resistant service during continuous live event coverage.",
                "Created dynamic dashboards for automation metrics, facilitating informed QA decision making and alignment with strategic goals."
            ]
        },
        {
            "company": "CraftedQ",
            "title": "QA Engineer",
            "location": "",
            "start_date": "Feb 2018",
            "end_date": "Jul 2020",
            "bullets": [
                "Developed Selenium-based test environments, driving 100% test coverage for multi-platform digital retailing solutions.",
                "Automated CI testing earmarked through Jenkins, optimizing vetting cycles and minimizing discrepancies.",
                "Configured scalable cloud-based tests with BrowserStack, enhancing parallel executions and reducing setup overhead.",
                "Validated API integrity using Mocha and Postman, securing synchronization between core services.",
                "Delivered distributed test schedules cutting execution times by 50% and increasing iteration frequency.",
                "Built comprehensive reporting systems for QA tracking, offering insight into process optimization.",
                "Aligned DevOps teams to streamline deployment cycles around QA gates, ensuring synchronized releases."
            ]
        }
    ],
    "education": [
        {
            "degree": "Bachelor’s degree in Computer Science",
            "school": "Argosy University",
            "start_year": "2013",
            "end_year": "2017"
        }
    ]
}
